{
  "about": {
    "title": "About",
    "introduction": "I'm a developer focused on usability, design and performance.",
    "copy1": "With almost a decade of experience, I've designed, developed and maintained complex solutions for a wide range of industries, from <agrimp>agricultural fair-trade platforms</agrimp> and <realxdata>real estate portfolio management</realxdata> to <gigmit>live music booking platforms</gigmit>.",
    "copy2": "I've successfully worked with cross-functional teams ranging from 2 to 20+ engineers, using modern technologies like Ruby on Rails, React, Next.js and Elasticsearch, among others, and using agile methodologies like Scrum and Kanban.",
    "copy3": "Currently on the Client Team at <imago>Imago</imago> collaborating to create the best media search experience possible.",
    "copy4": "I'm driven by collaboration and open communication in order to build great team spirit,solve problems and achieve exceptional results together.",
    "copy5": "On my free time, I <spotify>compose and record music</spotify>, play tennis and create generative art with TouchDesigner."
  },
  "career": {
    "title": "Career",
    "view_cv": "View full CV",
    "present": "Present",
    "descriptions": {
      "imago": "Full-Stack developer on a leading media provider in the world, working on taking the search experience to the next level providing our users with personalized results. Responsible for refactoring and modernizing legacy components, enforcing best practices and uphold high code quality standards.",
      "gigmit": "Full-Stack developer on an artist booking platform with in-app messaging, embedded media, ElasticSearch for quick artist search and filtering and A/B testing with Google Optimize. Also responsible for improving team/company processes, bringing Agile methodologies and best practices. Responsible for an API integration to consume gigmit data and perform authentication with JWT for a mobile app, in a project with 3 european partners.",
      "realxdata": "Ruby on Rails and React developer on a real estate analytics platform, responsible for migrating the front-end to React, refactor and re-structure the backend and implement best practices, useful design patterns and impove test coverage, writing meaningful and reliable unit and integration tests.",
      "runtime": "Full-Stack developer, working mostly with Ruby on Rails and React and in a short project with Django and Android native development. The main projects I worked on were an e-commerce platform for agriculture goods and a fintech platform for alternative investments.",
      "apibeton": "Freelance project developing an Android app that receives data from multiple sensors in a truck to provide drivers with real time monitorization of core aspects of their load and route.",
      "deloitte": "Part of the maintenance team on a project for a major insurance company in Portugal, working on their AS400 system (COBOL), reporting and fixing bugs. In a different internal project for Deloitte, I was responsible for the initial development of a website for HR management, designing the data model and developing the frontend layout.",
      "youship": "Internship as part of the final semester of my degree, where I was responsible for the Android development of a prototype for a shipping app, where a user sending a package is connected with a user who can transport it. Also responsible for a market study on similar apps and the product design."
    }
  },
  "sideProjects": {
    "title": "Side Projects",
    "descriptions": {
      "kofi": "NPM package for a React floating button component to accept donations to your Ko-fi account without leaving your app. Bundled with Rollup",
      "kglw": "Designed and developed a Next.js app with TailwindCSS that uses Spotify's API for data consumption and gives music recommendations. Used Vercel for deployment, test environments and DB hosting. Developed a payment solution with Paypal but removed the feature for the time being in favor of Ko-fi.",
      "almudawwar": "Designed, developed and deployed an SPA for my musical project using React, Vite, Typescript and Bulma to help on the design side. Used Vercel for deployment, test environments and file hosting."
    }
  },
  "footer": {
    "builtBy": "Designed and built by Rodrigo Guerreiro with Next.js, HeroUI and TailwindCSS. Deployed with Vercel."
  }
}
